src/cf/Catalogs/СостоянияУчастниковЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СостоянияУчастниковЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийУчастниковЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыДействийЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминПереходаВСостояниеЖенский</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминПереходаВСостояниеЖенскийЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминПереходаВСостояниеЖенскийЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминПереходаВСостояниеМужской</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминПереходаВСостояниеМужскойЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминПереходаВСостояниеМужскойЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ВидыСостоянийУчастниковЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийУчастниковЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОбработкеРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/СостоянияУчастниковЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет поставляемые данные.
// 
Процедура ЗаполнитьПоставляемыеДанные() Экспорт
	
	СостояниеУчастниковЗадачОбъект = ВОчереди.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'В очереди'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Выполнила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Выполнил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ВРаботе.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'В работе'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Взяла в работу'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Взял в работу'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ВозвращеноНаДоработку.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Возвращено на доработку'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ВозвращеноНаДоработку;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Вернула на доработку'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Вернул на доработку'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Выполнена.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Выполнена'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Выполнила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Выполнил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Завершил.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Завершил'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Завершил;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Завершила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Завершил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Зарегистрировано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Зарегистрировано'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Зарегистрировано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Зарегистрировала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Зарегистрировал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаИсполнении.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На исполнении'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала исполнение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал исполнение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаОбработкеРезолюции.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На обработке резолюции'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала обработку резолюции'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал обработку резолюции'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаОбработкеРезультата.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На обработке результата'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала обработку результата'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал обработку результата'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаОзнакомлении.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На ознакомлении'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала ознакомление'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал ознакомление'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаОзнакомленииСРезультатом.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На ознакомлении с результатом'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала ознакомление с результатом'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал ознакомление с результатом'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаОбеспеченииПодписания.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На обеспечении подписании'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала обеспечение подписание'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал обеспечение подписание'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаПроверке.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На проверке'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала проверку'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал проверку'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаРассмотрении.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На рассмотрении'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала рассмотрение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал рассмотрение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаРегистрации.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На регистрации'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала регистрацию'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал регистрацию'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаСогласовании.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На согласовании'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала согласование'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал согласование'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаУтверждении.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На утверждении'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала утверждение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал утверждение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаПодписании.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'На подписании'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.ВРаботе;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Начала подписание'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Начал подписание'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаправленоНаИсполнение.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Направлено на исполнение'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Направила на исполнение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Направил на исполнение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаправленоНаОзнакомление.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Направлено на ознакомление'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Направила на ознакомление'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Направил на ознакомление'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиЗарегистрировано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Зарегистрировано (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Зарегистрировано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Зарегистрировала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Зарегистрировал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиНеЗарегистрировано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не зарегистрировано (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеЗарегистрировано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отказала в регистрации'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отказал в регистрации'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиНеПодписано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не подписано (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеПодписано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Не подписала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Не подписал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиНеСогласовано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не согласовано (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеСогласовано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Не согласовала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Не согласовал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиНеУтверждено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не утверждено (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеУтверждено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Не утвердила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Не утвердил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиОтказаноВПереносеСрока.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отказано в переносе срока (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтказаноВПереносеСрока;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отказала в переносе срока'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отказал в переносе срока'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиОтклонено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отклонено (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтклоненоПриглашение;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отклонила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отклонил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиПеренесенСрок.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Перенесен срок (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ПеренесенСрок;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Перенесла срок'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Перенес срок'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиПодписано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Подписано (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Подписано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Подписала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Подписал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиПринято.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Принято (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ПринятоПриглашение;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Приняла'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Принял'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиРассмотрено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Рассмотрено (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Рассмотрено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Рассмотрела'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Рассмотрел'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиСогласовано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Согласовано (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Согласовано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Согласовала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Согласовал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиСогласованоСЗамечаниями.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Согласовано с замечаниями (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.СогласованоСЗамечаниями;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Согласовала с замечаниями'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Согласовал с замечаниями'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетОбработкиУтверждено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Утверждено (ожидает обработки)'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Утверждено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Утвердила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Утвердил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОжидаетПроверки.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Ожидает проверки'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.НаОбработкеРезультата;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Исполнила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Исполнил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НеЗарегистрировано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не зарегистрировано'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеЗарегистрировано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отказала в регистрации'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отказал в регистрации'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НеПодписано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не подписано'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеПодписано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Не подписала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Не подписал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НеСогласовано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не согласовано'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеСогласовано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Не согласовала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Не согласовал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НеУтверждено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Не утверждено'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НеУтверждено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Не утвердила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Не утвердил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Новая.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Новая'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Новая;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Направила на исполнение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Направил на исполнение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОбработанаРезолюция.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Обработана резолюция'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОбработанаРезолюция;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Обработала резолюцию'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Обработал резолюцию'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Ознакомился.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Ознакомился'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Ознакомился;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Ознакомилась'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Ознакомился'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОтказаноВПереносеСрока.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отказано в переносе срока'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтказаноВПереносеСрока;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отказала в переносе срока'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отказал в переносе срока'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Отклонено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отклонено'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтклоненоПриглашение;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отклонила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отклонил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Отложена.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отложена'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Отложена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отложила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отложил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Отменена.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отменена'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Отменена;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отменила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отменил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОтмененоПриглашение.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отменено приглашение'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтмененоПриглашение;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отменила приглашение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отменил приглашение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ОтправленоПовторно.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Отправлено повторно'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ОтправленоПовторно;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Отправила повторно'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Отправил повторно'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ПеренесенСрок.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Перенесен срок'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ПеренесенСрок;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Перенесла срок'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Перенес срок'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Подписано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Подписано'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Подписано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Подписала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Подписал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = ПодтвержденоПриглашение.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Подтверждено приглашение'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ПодтвержденоПриглашение;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Подтвердила приглашение'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Подтвердил приглашение'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Принято.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Принято'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ПринятоПриглашение;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Приняла'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Принял'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Проверено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Проверено'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Проверено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Проверила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Проверил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Рассмотрено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Рассмотрено'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Рассмотрено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Рассмотрела'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Рассмотрел'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаправленоПомощнику.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Направлено помощнику'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоПомощнику;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Направила помощнику'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Направил помощнику'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = НаправленоАвтору.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Направлено автору'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.НаправленоАвтору;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Направила автору'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Направил автору'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
		
	СостояниеУчастниковЗадачОбъект = Согласовано.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Согласовано'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Согласовано;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Согласовала'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Согласовал'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = СогласованоСЗамечаниями.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Согласовано с замечаниями'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.СогласованоСЗамечаниями;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Согласовала с замечаниями'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Согласовал с замечаниями'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
	СостояниеУчастниковЗадачОбъект = Утверждено.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Утверждено'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.Утверждено;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Утвердила'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Утвердил'");
	ОбновлениеИнформационнойБазыХолдинг.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
	
КонецПроцедуры

// Определяет состояния, которые обозначают что задача ожидает выполнения.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.СостоянияУчастниковЗадач. 
// 	
Функция СостоянияОжидаетВыполнения() Экспорт
	
	СостоянияОжидаетВыполнения = Новый Массив;
	
	ОжидаемыеДействия = Перечисления.ВидыСостоянийУчастниковЗадач.ОжидаемыеДействия();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СостоянияУчастниковЗадач.Ссылка КАК СостояниеОжидаетВыполнения
		|ИЗ
		|	Справочник.СостоянияУчастниковЗадач КАК СостоянияУчастниковЗадач
		|ГДЕ
		|	СостоянияУчастниковЗадач.ВидСостояния В (&ОжидаемыеДействия)");
	
	Запрос.УстановитьПараметр("ОжидаемыеДействия", ОжидаемыеДействия);
	
	СостоянияОжидаетВыполнения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СостояниеОжидаетВыполнения");
	
	Возврат СостоянияОжидаетВыполнения;
	
КонецФункции

// Определяет состояния, которые обозначают что задача ожидает выполнения или начатая (и те, и те).
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.СостоянияУчастниковЗадач.
//
Функция СостоянияНачатоеИлиОжидаемоеДействие() Экспорт
	
	СостоянияНачатоеИлиОжидаемоеДействие = Новый Массив;
	
	НачатыеИОжидаемыеДействия = Перечисления.ВидыСостоянийУчастниковЗадач.НачатыеИОжидаемыеДействия();
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СостоянияУчастниковЗадач.Ссылка КАК СостоянияНачатоеДействие
		|ИЗ
		|	Справочник.СостоянияУчастниковЗадач КАК СостоянияУчастниковЗадач
		|ГДЕ
		|	СостоянияУчастниковЗадач.ВидСостояния В (&НачатыеИОжидаемыеДействия)");
	
	Запрос.УстановитьПараметр("НачатыеИОжидаемыеДействия", НачатыеИОжидаемыеДействия);
	
	СостоянияНачатоеИлиОжидаемоеДействие = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СостоянияНачатоеДействие");
	
	Возврат СостоянияНачатоеИлиОжидаемоеДействие;
	
КонецФункции

// Определяет, что это ожидающее выполнение действие
//
// Параметры:
//  Состояние - СправочникСсылка.СостоянияУчастниковЗадач - состояние
// 
// Возвращаемое значение:
//  Булево - Это ожидающее выполнение действие
//
Функция ДействиеОжидаетВыполнение(Состояние) Экспорт
	
	Если ТипЗнч(Состояние) <> Тип("СправочникСсылка.СостоянияУчастниковЗадач") Тогда
		ВызватьИсключение НСтр("ru = 'Несооответствие типов. Требуется СправочникСсылка.СостоянияУчастниковЗадач'");
	КонецЕсли;
	
	СостоянияОжидающиеВыполнения = СостоянияОжидаетВыполнения();
	
	Возврат СостоянияОжидающиеВыполнения.Найти(Состояние) <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, 
    Параметры, СтандартнаяОбработка, Метаданные.Справочники.СостоянияУчастниковЗадач);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
